---
kind: other
id: Methods.T:Autodesk.Revit.DB.AlphanumericRevisionSettings
source: html/3e3eba30-5c8c-c270-8228-a1394dd2436b.htm
---
# AlphanumericRevisionSettings Methods

Gets a list containing the strings to be used as the numbering sequence for
 revisions with the Alphanumeric RevisionNumberType.